Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་ལག་ཏུ་སོན་པར་འགྱུར་བའི་སེམས་ཅན་དེ་ནི་དགེ་བའི་རྩ་བ་ཆུང་ངུ་སྐྱེད་པ་མ་ཡིན་ནོ། །ལག་ན་རྡོ་རྗེ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་མ་མཐོང་བ་དང་། བསྙེན་བཀུར་མ་བྱས་པ་དང་། ཕྱག་རྒྱ་དང་།
en: The roots of virtue planted by any being who was fortunate to obtain the king of vidyās are not small.

source: དཀྱིལ་འཁོར་དང་། དམ་ཚིག་དང་། གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། རིག་སྔགས་ཀྱི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ་མ་ཐོས་ཤིང་མ་ཞུགས་པ་གང་ཡིན་པ་དེས་ནི། ལག་ན་རྡོ་རྗེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་དེའི་ལག་ཏུ་ཕྱིན་པར་མི་འགྱུར་རོ།
en: A person, O Vajrapāṇi, who has neither studied nor understood this king of vidyā rites, with its chapters on the mudrās, maṇḍalas, and samaya mantras, and has not thereby seen and served the hundreds of thousands of millions of billions of tathāgatas of the three times, as numerous as the grains of sand in ninety-nine Gaṅgā rivers, will not, O Vajrapāṇi, be fortunate to obtain this king of vidyās.

source: །མི་ཐོས་ཤིང་མི་མཐོང་ལ། མིང་གི་སྒྲ་གྲགས་པ་ཙམ་དུའང་མི་འགྱུར་རོ།
en: He will not hear it, see it, or even pronounce the mere sound of its name. “

source: །ལག་ན་རྡོ་རྗེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི། གང་གི་ལག་ཏུ་སོན་པར་འགྱུར་བ་དེས་ནི། ལག་ན་རྡོ་རྗེ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དེའི་ལག་ཏུ་སོན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱི་དྲུང་དུ།
en: However, Vajrapāṇi, the fortunate person who obtains this king of vidyās will meet hundreds of thousands of millions of billions of tathāgatas, the worthy, realized buddhas of the three times who are as numerous as the grains of sand in ninety-nine Gaṅgā rivers.

source: རིགས་ཀྱི་དམ་ཚིག་གི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། སྙིང་པོ་དང་། གསང་བའི་ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་ལག་ཏུ་སོན་པར་འགྱུར་རོ།
en: He will obtain, from these tathāgatas, the samayas of all the families and the maṇḍalas, mudrās, and sets of mantras, and the rites that invoke the secret essence.

source: །གནས་ཐམས་ཅད་དུ་སོང་ཞིང་རྗེས་སུ་ཞུགས་པར་འགྱུར་རོ། །ཐམས་ཅད་རྗེས་སུ་སོང་ཞིང་།
en: He will be able to visit and enter anywhere he wants and will know the right time and occasion for everything.

source: དམ་ཚིག་ཤེས་པར་འགྱུར་རོ། །རིག་སྔགས་ཐམས་ཅད་དང་། གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། ཕྱག་རྒྱ་ཡང་དག་པར་སྤྱོད་པར་འགྱུར་རོ།
en: He will master all vidyās and the sets of mantras and mudrās.

source: །རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་མཆོག་དང་། གཙོ་བོ་དང་ཐུ་བོར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཐམས་ཅད་ཀྱི་དྲུང་ན།
en: He will be the most prominent and most senior among all vidyā holders.

source: སྲས་ཀྱི་གཙོ་བོར་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ལུང་སྟོན་པར་འགྱུར་རོ།
en: As the eldest son of the tathāgatas of the three times, such a vidyā holder will obtain a prophecy of his future awakening directly from them.

source: །དགེ་བའི་རྩ་བ་ཉེ་བར་སྟོན་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: He will plant roots of virtue and accumulate a lot of merit.

source: །ལག་ན་རྡོ་རྗེ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི། གང་གི་ལག་ཏུ་སོན་ཅིང་ཐོབ་པར་འགྱུར་བའི་སེམས་ཅན་གང་ཡིན་པ་དེ་ནི། དེའི་ཡོན་ཏན་དང་། ཕན་ཡོན་གཞལ་དུ་མེད་པ་ཐོབ་པར་འགྱུར་རོ།
en: Anyone fortunate enough to obtain this king of vidyās will become accomplished and will obtain all excellent qualities and the auspicious state of a buddha.

source: །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི། གང་གི་ལག་ཏུ་སོན་པར་འགྱུར་བ་དེ། སངས་རྒྱས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་སོ་སོར་རྙེད་པར་འགྱུར་རོ།
en: This will happen to a fortunate person who obtains the king of vidyās.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་སྨྲས་ནས། རང་གི་གཟུགས་ཀྱི་བདག་ཉིད་ཀྱི་དངོས་པོ་པདྨའི་ཟེ་འབྲུའི་དབུས་སུ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འཕགས་པར་བལྟས་ནས།
en: Noble Avalokiteśvara, the great bodhisattva being, taught the king of vidyās and watched it emerge from within the pericarp of the lotus, the lotus that was in essence himself.

source: དོན་ཡོད་པ་ཡིད་བཞིན་ནོར་བུའི་འོད་ཅེས་བྱ་བ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་བཅོམ་ལྡན་འདས་ལ་ཕུལ་བར་གྱུར་ཏོ།
en: He then pronounced the king of vidyās, the precious great jewel called the light of the wish-fulfilling amogha jewel before the Blessed One: [314] “Oṁ, wish-fulfilling amogha jewel! The boon-granting lotus! You with blazing arms, blaze!

source: །ཨོཾ་ཨ་མོ་གྷ་ཙིནྟཱ་མ་ཎི་བར་ད་པདྨེ་ཛྭ་ལ་ཛྭ་ལ་ན་བྷུ་ཛེ་ཧཱུྃ།
en: Hūṁ! “

source: འདི་ནི་དོན་ཡོད་པ་པདྨ་དྲི་མ་མེད་པའི་ཆུ་སྐྱེས་ཀྱི་ཞགས་པའི་རྩ་བའི་སྙིང་པོའོ།
en: This is the root heart mantra of Unfailing Lotus-Noose Pure as a Lotus.”

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། བཅོམ་ལྡན་འདས་ལ་ཕུལ་བའི་དེ་མ་ཐག་པ་དེ་ནས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན། བཅོམ་ལྡན་འདས་ལ་སྤྱན་མི་འཛུམས་པར་བལྟ་ཞིང་འཁོད་དོ།
en: As soon as the mantra was pronounced by Noble Avalokiteśvara in the presence of the Blessed One, all the blessed kings of vidyās who were sitting opposite the blessed Śākyamuni fixed their unblinking gaze on him and waited in anticipation.

source: །བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་དོན་ཡོད་པ་ཡིད་བཞིན་ནོར་བུའི་འོད་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ལ་ཡང་། རིག་སྔགས་ཀྱི་རྒྱལ་པོས་སྤྱི་བོ་ནས་དབང་བསྐུར་རོ།
en: The Blessed Śākyamuni, for his part, gazed back at the king of vidyās, the precious great jewel, the Light of the Wish-Fulfilling Amogha Jewel, and consecrated his head.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདིས་དབང་བསྐུར་མ་ཐག་ཏུ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རི་དང་། ནགས་དང་འབྲོག་དགོན་པར་བཅས་པ་རྣམས་རྣམ་པར་འགྱུར་བ་དྲུག་ཏུ་གཡོས་སོ།
en: As soon as the king of vidyās was consecrated by the Blessed One, the world spheres of the entire great trichiliocosm, along with their mountains, forests, and deserts, quaked in six different ways.

source: །ཕྱོགས་བཅུ་ཀུན་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བར་གྱུར་ཏོ། །དེས་ན་དུས་གསུམ་དུ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ནམ་མཁའི་དབྱིངས་སུ་རྫུ་འཕྲུལ་གྱིས་བཞུགས་ཏེ།
en: All the tathāgatas throughout the ten directions, the fully realized buddhas established throughout the three times, became clearly visible, appearing, through their magical power, to be suspended in the canopy of the sky.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: They applauded the blessed Tathāgata Śākyamuni: “Good!

source: ཤཱཀྱ་ཐུབ་པ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བའི་མངོན་པར་དབང་བསྐུར་བའི་རྒྱལ་པོ་འདིས་མངོན་པར་དབང་བསྐུར་བ་འདི་ལེགས་སོ་ལེགས་སོ།
en: It is good, Śākyamuni! This king of consecrations is extremely difficult to obtain.

source: །དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་སྔ་མ་རྣམས་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་རིག་པའི་རྒྱལ་པོ་འདིས་དབང་བསྐུར་རོ།
en: The king of vidyās was also consecrated by the former tathāgatas established throughout the three times.

source: །ངེད་ཐམས་ཅད་ཀྱིས་ཀྱང་ཚིག་གཅིག་ཏུ་མཐུན་པས་དོན་ཡོད་པ་ཡིད་བཞིན་ནོར་བུའི་འོད་ལ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོས་མངོན་པར་དབང་བསྐུར་རོ།
en: All of us declare with a single voice that each of us will also consecrate the great king of vidyās, the Light of the Wish-Fulfilling Amogha Jewel.”

source: །དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱང་ཕྱག་གསེར་གྱི་ཁ་དོག་ཅན་བརྐྱང་ནས།
en: Subsequently, each of the tathāgatas established throughout the three times extended his golden hand and consecrated the king of vidyās by anointing his head.

source: དེ་རྣམས་ཐམས་ཅད་ལ་རིག་པའི་རྒྱལ་པོས་སྤྱི་བོའི་གཙུག་ནས་མངོན་པར་དབང་བསྐུར་རོ།
en: Each tathāgata thus bestowed the mudrā consecration upon the king of vidyās.

source: །འདི་ནི་མངོན་པར་དབང་བསྐུར་བའི་ཕྱག་རྒྱ་མངོན་པར་དབང་བསྐུར་བ་དང་ལྡན་པའོ།
en: The mantra for the mudrā consecration is: [315] “Oṁ, amogha jewel-lotus of the splendorous great mudrā!

source: །ཨོཾ་ཨ་མོ་གྷ་བཻ་རོ་ཙ་ན་མ་ཧཱ་མུ་དྲཱ་མ་ཎི་པདྨེ་ཛྭ་ལ་པྲ་བརྡྷ་ཡ་ཧཱུྃ།
en: Blaze! Set in motion! Hūṁ!”

source: ཕྱག་རྒྱ་ཆེན་པོས་མངོན་པར་དབང་བསྐུར་མ་ཐག་ཏུ། བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཤེགས་ནས་མི་སྣང་བར་གྱུར་ཏོ།
en: Immediately after bestowing the great mudrā of consecration, each tathāgata congratulated the king of vidyās and disappeared, returning to his particular buddha field.

source: །དེ་ནས་རིག་པའི་རྒྱལ་པོ་དེ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཕྱག་རྒྱས་དབང་བསྐུར་བ་རིག་ནས། བཅོམ་ལྡན་འདས་ལ་གཡས་སུ་བསྐོར་བ་གསུམ་བྱས་ནས་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། ཕྱག་བྱས་ནས་སྤྱན་སྔར་འདུག་སྟེ་སེམས་པར་གྱུར་ཏོ།
en: The king of vidyās, understanding that he had just received the mudrā consecration from all the tathāgatas, circumambulated the Blessed One clockwise three times, saluted him, and stood before him with his cupped hands pressed together in reverence, deep in thought.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་རིག་སྔགས་འཆང་དེའི་རིག་པའི་རྒྱལ་པོ་སེམས་པར་གཟིགས་ནས། ཇི་ལྟར་ད་ལྟར་ཡིད་ལ་བྱེད་པ་ཡང་དག་པར་རབ་ཏུ་གསལ་བར་མཛད་དོ། །ཨོཾ་ཨ་མོ་གྷ་མཎྜ་ལ་པདྨ་ཨ་བྷི་ཥེ་ཀཾ་མ་ཎི་བཛྲེ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་བྷི་ཥེ་ཀེ་ཧཱུྃ། རིག་པའི་རྒྱལ་པོ་དེས་དཀྱིལ་འཁོར་དུ་མངོན་པར་དབང་བསྐུར་བས་མངོན་པར་དབང་བསྐུར་མ་ཐག་ཏུ།
en: The Blessed One, perceiving the thoughts arising in the king of vidyā’s mind, gave expression to these thoughts by bestowing upon him, the bearer of vidyā, the next consecration with the mantra: [316] “Oṁ, the lotus consecration into the amogha maṇḍala!

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་རིགས་ཐུན་མོང་བའི་དམ་ཚིག་རྡོ་རྗེ་ཆེན་པོའི་ཚུལ་གྱིས་ས་གཞི་བྱིན་གྱིས་བརླབས་སོ།
en: The precious vajra-like consecration from all the tathāgatas! Hūṁ! As soon as the king of vidyās received both the maṇḍala consecration in the secret maṇḍala and the samaya of the sameness of all the tathāgata families, the great earth turned into vajra.

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་དང་། པདྨའི་རིགས་དང་། རྡོ་རྗེའི་རིགས་དང་། ནོར་བུའི་རིགས་རྣམ་པར་ཐར་པ་ཆེན་པོའི་དཀྱིལ་འཁོར། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆེར་འཁྲིགས་པའི་དཀྱིལ་འཁོར་དུ་བརྟགས་པ་མཐོང་ངོ་།
en: The great maṇḍala of liberation consisting of the tathāgata, lotus, vajra, and jewel families appeared before the Blessed One arrayed in a great circle.

source: །རང་རང་གི་དགེ་བའི་རྩ་བས་རིག་པའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་བའི་ལྷ་ཐམས་ཅད་མཐོང་ངོ་། །རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་ཆེ་ཞིང་ཆེ་བ་དག་བྱུང་ངོ་། །དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་ཤིན་ཏུ་ངོ་མཚར་བ་དག་མཐོང་ངོ་།
en: Based on the respective roots of virtue of all the vidyā deity-kings, their maṇḍalas appeared accompanied by a great display of miracles and extraordinary and amazing amogha magical creations.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་དཀྱིལ་འཁོར་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་འདི་ལྟ་བུ་མཐོང་ནས་དོན་ཡོད་པའི་མཆོད་པའི་ནོར་བུ་རྡོ་རྗེ་བྱིན་གྱིས་རློབས་པ་དེ་བཞིན་གཤེགས་པའི་མངོན་པར་དབང་བསྐུར་བ་བཅོམ་ལྡན་འདས་ཀྱིས་རྗེས་སུ་གནང་བ་དང་ལྡན་པའོ།
en: Noble Avalokiteśvara, the great bodhisattva being, saw this great miraculous maṇḍala and spoke the tathāgata consecration mantra—the one that conjures amogha offerings and bestows the blessings of the precious vajra—to the Blessed One: [317] “Oṁ, amogha offerings, appear for the jewel, lotus, vajra, and tathāgata families! Spread everywhere!

source: །ཨོཾ་ཨ་མོ་གྷ་པཱུ་ཛ་མ་ཎི་པདྨ་བཛྲེ་ཏ་ཐཱ་ག་ཏ་བི་ལོ་ཀི་ཏེ་ས་མནྟ་པྲ་ས་ར་ཧཱུྃ།
en: Hūṁ!”

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་དོན་ཡོད་པ་མཆོད་པའི་ནོར་བུའི་སྙིང་པོ་བྱིན་མ་ཐག་ཏུ་མཆོད་པ་རྒྱ་ཆེན་པོ་རྣམ་པ་སྣ་ཚོགས་པ་དུ་མ་རབ་ཏུ་བྱུང་སྟེ།
en: As soon as this mantra, the heart essence of the precious jewel of amogha worship, was pronounced by Noble Avalokiteśvara, there appeared a great variety of offerings, vast and opulent.

source: ཇི་ལྟར་རང་རང་གི་ཆོ་ག་ཇི་ལྟ་བ་བཞིན་དུ་མཆོད་པ་ཆེན་པོ་རྣམས་རབ་ཏུ་བྱུང་ངོ་།
en: These vast offerings appeared for their respective recipients and were distributed accordingly.

source: །ལྷ་རྫས་རྣམ་པ་སྣ་ཚོགས་པ་རྣམ་པར་བཀྲ་བ་ཡངས་པ་རྒྱ་ཆེན་པོ་གོ་སྐབས་ཀུན་ཏུ་གནས་པར་གྱུར་ཏོ།
en: Various divine and wonderful objects were arranged in a vast array that extended far and wide.

source: །དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཆེ་ཞིང་ཆེ་བའི་བྱིན་གྱིས་བརླབས་ཀྱི་བཀོད་པ་རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་ཆེན་པོ་ཡང་དག་པར་མཐོང་ངོ་།
en: A great vidyā maṇḍala could be seen, with a vast miraculous display created through the blessing and great magical power of the tathāgatas.

source: །དེ་ནས་རིག་པའི་རྒྱལ་པོ་དོན་ཡོད་པ་པདྨ་དྲི་མ་མེད་པ་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལས་རིང་པོར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལས་མངོན་དུ་ཕྱོགས་ནས་སྟན་ལ་འདུག་གོ།
en: The great king of vidyās named Unfailing and as Pure as a Lotus circumambulated the Blessed One clockwise three times, saluted him by bowing his head to his feet, and took a seat opposite Noble Avalokiteśvara, not far from the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། ཕྱག་ན་རྡོ་རྗེ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རྣམ་པར་འཕྲུལ་བ།
en: The Blessed One then addressed Vajrapāṇi, the great general of yakṣas: “Look, Vajrapāṇi, at the magical creations of Noble Avalokiteśvara!

source: ཏིང་ངེ་འཛིན་གྱི་སྟོབས་བྱིན་གྱིས་རློབ་པའི་ཁྱད་པར།
en: See the power of his samādhi and his special blessing!

source: ཕྱག་རྒྱ་ཆེན་པོ་དང་། གསང་སྔགས་དང་། གཟུངས་དང་།
en: See the great power of his great mudrās, mantras, dhāraṇīs, and rites!

source: ཆོ་ག་ཞིབ་མོའི་མཐུ་སྟོབས་པདྨ་ཡངས་པ་ཆེན་པོའི་གསང་བ་དོན་ཡོད་ཞགས་པའི་རྣམ་པར་འཕྲུལ་པ་རིག་པའི་རྒྱལ་པོའི་དེ་ཁོ་ན་ཉིད་ཀྱི་སྙིང་པོ་གྲུབ་པ་དམ་ཚིག་དང་རྗེས་སུ་མཐུན་པ་མཐུ་སྟོབས་དང་ཡོན་ཏན་འབྱུང་བ་ལ་ཕན་པ།
en: These are the magical creations of Amoghapāśa, who belongs to the great secret lotus-family, and whose power is derived from accomplishing the heart essence of the king of vidyās. It accords with his samaya.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོའི་རྣམ་པར་འཕྲུལ་པ་ཡིད་ཀྱི་ཤིང་རྟ་རེ་བ་ཐམས་ཅད་ཀྱི་མཆོག་རབ་ཏུ་སྦྱིན་པ་ལ་ལྟོས།
en: The king of vidyās, which magically arises from the heart essence of all tathāgatas, is the source of good qualities.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་རྗེས་སུ་སྦྱིན་ཏེ་རིག་པའི་རྒྱལ་པོ་འདི།
en: He fulfills all wishes and desires and grants every boon. It is because of Noble Avalokiteśvara that wishes are fulfilled and boons are granted.

source: ཕྱི་མའི་དུས་ཕྱི་མའི་ཚ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་འགྱུར་རོ།
en: The king of vidyās will carry out the work of the Buddha in the final time of the final period.

source: །རིག་པའི་རྒྱལ་པོ་འདི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྣང་བར་བྱེད་པར་འགྱུར་རོ། །སྐྱབས་དང་།
en: It will, at that time, bring light to all beings. “

source: དཔུང་གཉེན་དང་། འཁྲས་དང་། ཡིད་ཀྱི་ཤིང་རྟ་རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །དགྲ་ཐམས་ཅད་རབ་ཏུ་འདུལ་བར་བྱེད་དོ། །བགེགས་དང་ལོག་པར་འདྲེན་པ་ཐམས་ཅད་རྣམ་པར་འཇིག་པར་བྱེད་དོ།
en: The king of vidyās is the ultimate refuge; it fulfills all wishes and hopes, pacifies all evil, crushes all enemies, and destroys all vighnas and vināyakas.

source: །ཆར་ཆེས་པ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །ཆར་མེད་ན་ཆར་འབེབས་སོ།
en: It pacifies floods and causes rain to fall during a drought.

source: །རླུང་དང་། སད་དང་། སེར་བ་ལྡོག་པར་བྱེད་དོ། །མུ་གེའི་དགོན་པ་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: It stops cold spells, hurricanes, and hail, and it pacifies famines and calamities.

source: །ནད་ཐམས་ཅད་ལྡོག་པར་བྱེད་དོ། །གདུག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: It prevents all disease and eradicates all wickedness.

source: །ཚེ་དང་ནད་མེད་པ་འཕེལ་བར་བྱེད་དོ། །བསོད་ནམས་སྦྱིན་པ་དང་། དབང་ཕྱུག་སྦྱིན་པ་དང་། ནོར་སྦྱིན་པ་དང་། འབྲུ་འཕེལ་བར་བྱེད་དོ།
en: It grants long life, promotes good health, and increases merit, influence, wealth, and stores of grain.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་དོན་ཡོད་པ་དྲི་མ་མེད་པའི་ཆུ་སྐྱེས་ཀྱི་གཟུངས་ཀྱི་སྙིང་པོའི་ཡོ་བྱད་དང་། ཆོ་ག་བཀླགས་པས་འགྲུབ་པའི་དངོས་གྲུབ་གསུངས་སོ།
en: Noble Avalokiteśvara, the great bodhisattva being, then proceeded to explain the practice procedure of the heart dhāraṇī of the pure amogha-lotus and the accomplishments resulting from the study and practice of it. “

source: །དེ་ནས་སྙིང་པོ་འདི་བཀླགས་པས་འགྲུབ་པར་འགྱུར་ཏེ། རིག་པའི་རྒྱལ་པོ་བཀླགས་པས་དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་འགུགས་པར་འགྱུར་རོ།
en: Once the vidyā holder has perfected the recitation of this heart dhāraṇī, he will be able, upon reciting the king of vidyās, to summon the deities of the maṇḍala.

source: །སྟོང་ཕྲག་བརྒྱ་བཟླས་པས་པདྨོ་ཡངས་པའི་དཀྱིལ་འཁོར་དང་། གཞལ་མེད་ཁང་གི་རྒྱན་མཐའ་དག་དང་། རིག་པའི་རྒྱལ་པོ་དང་བཅས་པའི་ལྷ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་།
en: After reciting the dhāraṇī one thousand and eight times, he will see the great lotus maṇḍala adorned with all its palaces, including those of the king of vidyās, the deities, the tathāgatas, and Noble Avalokiteśvara.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཞལ་མེད་ཁང་དང་དཀྱིལ་འཁོར་དང་གཞལ་མེད་ཁང་མཐའ་དག་མཐོང་ངོ་།
en: He will see all the usual maṇḍala structures.

source: །དེ་ལ་ལྷ་རྣམས་རབ་ཏུ་འཇུག་པར་བྱེད་དོ།
en: He should cause the deities to enter it.

source: །དམ་ཚིག་ཤེས་པར་ཡང་འགྱུར་རོ། །རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་དུ་མངོན་པར་དབང་བསྐུར་བར་ཡང་འགྱུར་རོ། །ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་རྗེས་སུ་མཐུན་པར་ཡང་འགྱུར་རོ།
en: He will gain the understanding of the samaya, receive the vidyā consecration into the maṇḍala, and be able to employ mudrās accordingly. “

source: །དང་པོ་རྨི་ལམ་མཐོང་བ་ཙམ་གྱིས་འགྲོའོ།
en: The first time, the vidyā holder will merely have a vision in his sleep.

source: །གཉིས་པར་རྨི་ལམ་མཐོང་བ་ལ་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་མཐོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་དང་།
en: The second time, he will see in his sleep the maṇḍala of the tathāgata family, along with all the tathāgatas, hosts of bodhisattvas, and vidyā deities of the maṇḍala.

source: རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་རྣམས་ཀྱིས་རང་གི་རྒྱན་དང་དཀྱིལ་འཁོར་བརྟགས་པ་མཐོང་ངོ་། །གཞལ་ཡས་ཁང་རྒྱ་ཆེན་པོ་དང་བཅས་པ་ཡང་མཐོང་ངོ་། །དེར་ཡང་རབ་ཏུ་འཇུག་པར་བྱེད་དེ། དམ་ཚིག་ཀྱང་འཛིན་པར་བྱེད་དོ།
en: He will see it adorned with all the maṇḍala-ornaments, and he will see its palatial estates in all their detail.

source: །ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་། གསང་སྔགས་དང་། མངོན་པར་དབང་བསྐུར་བ་ཡང་སོ་སོར་ཐོབ་བོ། །རིག་སྔགས་དང་བཅས་པའི་དངོས་གྲུབ་རབ་ཏུ་ཐོབ་བོ།
en: He will enter, gain the knowledge of the samaya, receive the mudrā, maṇḍala, and mantra consecration, and accomplish the vidyā. “

source: །གསུམ་པར་རྨི་ལམ་མཐོང་བ་ན། རྡོ་རྗེ་རིགས་ཀྱི་དཀྱིལ་འཁོར་མཐོང་སྟེ་དེ་བཞིན་གཤེགས་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་དང་རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་རྣམས་དང་བཅས་པ་རང་གི་རྒྱན་དང་དཀྱིལ་འཁོར་དུ་བརྟགས་པ་དང་།
en: The third time, the vidyā holder will see in his sleep the maṇḍala of the vajra family, along with all the tathāgatas, hosts of bodhisattvas, and vidyā deities of the maṇḍala.

source: གཞལ་མེད་ཁང་རྒྱ་ཆེན་པོ་དང་བཅས་པ་མཐོང་ངོ་།
en: He will see it adorned with all the maṇḍala ornaments and its palatial estates in all their detail.

source: །དེ་ལ་ཡང་རྡོ་རྗེ་འཆང་རབ་ཏུ་འཇུག་པར་བྱེད་དོ། །དམ་ཚིག་གི་ཕྱག་རྒྱ་སྦྱིན་པར་བྱེད་དོ།
en: He should enter it and display the samaya mudrā.

source: །མངོན་པར་དབང་བསྐུར་བས་མངོན་པར་དབང་སྐུར་བར་བྱེད་དོ། །རིག་སྔགས་ཐམས་ཅད་དང་། དོན་ཡོད་པའི་རིམ་པར་ཕྱེ་བའི་དངོས་གྲུབ་ཆེན་པོ་དང་།
en: He will then receive the consecration and be consecrated to attain the great amogha accomplishment of all the vidyās.

source: མངོན་པར་དབང་བསྐུར་བས་མངོན་པར་དབང་སྐུར་བར་བྱེད་དོ། །རྡོ་རྗེའི་རིགས་ཀྱི་དངོས་གྲུབ་ཆེན་པོ་དང་། དམ་ཚིག་ཐམས་ཅད་སོ་སོར་ཐོབ་བོ།
en: He will obtain the samaya to attain the great accomplishment of the entire vajra family. “

source: །བཞི་པར་རྨི་ལམ་མཐོང་བ་ན། ནོར་བུའི་རིགས་ཆེན་པོའི་དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱའི་རིམ་པར་ཕྱེ་བ་དང་ཆོ་ག་ཞིབ་མོ་དང་།
en: The fourth time, the vidyā holder will see in his sleep the great maṇḍala of the jewel family, along with its mudrās and rites.

source: རང་གི་རྒྱན་དང་དཀྱིལ་འཁོར་མཐོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ལྷའི་ཚོགས་དང་དཀྱིལ་འཁོར་དུ་གནས་པའི་ལྷ་དང་། རིག་པའི་རྒྱལ་པོ་ཡང་མཐོང་སྟེ།
en: He will see a well-adorned maṇḍala with all the tathāgatas, hosts of bodhisattvas, hosts of devas, and vidyā deities dwelling in the maṇḍala, including the king of vidyās.

source: དེ་ལ་ཡང་རབ་ཏུ་འཇུག་པར་བྱེད་དོ། །ཕྱག་རྒྱ་དང་། དམ་ཚིག་དང་། ཆོ་ག་དང་བཅས་པ་རྗེས་སུ་ཐོབ་སྟེ།
en: He should enter it and receive the mudrā, the samaya, the corresponding practice procedure, and the consecration.

source: མངོན་པར་དབང་བསྐུར་བ་ཡང་རབ་ཏུ་ཐོབ་བོ། །དངོས་གྲུབ་ཆེན་པོ་དང་མཆོག་སྦྱིན་ཡང་སོ་སོར་ཐོབ་ཅིང་ཐམས་ཅད་དུ་མངོན་པར་དབང་བསྐུར་བར་ཡང་འགྱུར་རོ།
en: He will obtain great accomplishments and boons, and his consecration will be universally applicable. “

source: །ལྔ་པར་རྨི་ལམ་མཐོང་བ་ན་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དུ་བརྟགས་པ་དང་།
en: The fifth time, the vidyā holder will see the maṇḍala of the lotus family in his sleep.

source: དོན་ཡོད་ཞགས་པའི་དཀྱིལ་འཁོར་དུ་བརྟགས་པ་དང་། པོ་ཊ་ལ་ཀའི་རིའི་གཞལ་མེད་ཁང་དང་བཅས་པ་མཐོང་ངོ་།
en: It will be arrayed as a maṇḍala of Amoghapāśa, a maṇḍala of liberation complete with the Potala palace.

source: །དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་དང་། ལྷ་དང་བཅས་པ་དང་། རིག་པའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་ཀྱི་ལྷ་རྣམས་མཐོང་སྟེ།
en: He will see all the tathāgatas, hosts of bodhisattvas, devas, and the king of vidyās, along with the other maṇḍala deities.

source: དེ་ལ་ཡང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་ཉིད་སེམས་ཅན་དེ་ལ་རབ་ཏུ་འཇུག་པར་བྱེད་དོ།
en: Noble Avalokiteśvara himself ushers all beings into this maṇḍala.

source: །དམ་ཚིག་དང་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་དང་གསང་སྔགས་དང་གཟུངས་ཀྱི་དངོས་གྲུབ་སོ་སོར་ཐོབ་པོ། །རང་ཉིད་ཀྱང་དོན་ཡོད་པའི་རིག་སྔགས་ཀྱི་དབང་གིས་མངོན་པར་དབང་བསྐུར་ཏེ། མངོན་པར་དབང་སྐུར་བར་བྱེད་དོ། །ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་དང་།
en: The vidyā holder will obtain the accomplishment of the samaya, mudrā, maṇḍala, mantra, and dhāraṇī.

source: དངོས་གྲུབ་ཀྱང་རྗེས་སུ་སྩོལ་བར་བྱེད་དོ། །མཆོག་ཐམས་ཅད་རབ་ཏུ་སྦྱིན་པ་སོ་སོར་ཐོབ་བོ།
en: He will consecrate himself with the amogha vidyā-consecration, will be successful in every rite, and will obtain every boon. “

source: །དྲུག་པར་རྨི་ལམ་མཐོང་བ་ན། དཀྱིལ་འཁོར་ཆེན་པོ་མཐོང་སྟེ།
en: The sixth time, the vidyā holder will see the great maṇḍala in his sleep.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཕྱག་སྟོང་བ་མཐོང་ངོ་། །གཞལ་མེད་ཁང་དང་བཅས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: He will see the thousand-armed Noble Avalokiteśvara and the hosts of bodhisattvas in their palatial dwelling, along with the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་མཐོང་སྟེ་དེ་ལ་ཡང་རབ་ཏུ་འཇུག་པར་བྱེད་དོ། །ཕྱག་རྒྱ་དང་གསང་སྔགས་དང་དམ་ཚིག་དང་མངོན་པར་དབང་བསྐུར་བ་སོ་སོར་ཐོབ་སྟེ།
en: He should enter it and obtain the mudrā, mantra, samaya, and consecration.

source: རིག་སྔགས་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་ཀྱི་མཆོག་སྦྱིན་པ་སོ་སོར་ཐོབ་བོ།
en: He will accomplish all vidyās and obtain every boon. “

source: །བདུན་པར་རྨི་ལམ་ཆེན་པོ་མཐོང་བས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཤེགས་ནས་རྡོ་རྗེའི་གདན་ལ་བཞུགས་པ་མཐོང་སྟེ།
en: The seventh time, the vidyā holder will have a grand dream-vision of the Tathāgata Vairocana sitting on the vajra seat, the seat of awakening.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། བདུད་འདུལ་བ་མཐོང་ངོ་།
en: He will see him set the Dharma wheel in motion and overpower Māra.

source: །དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཕྱག་གསེར་གྱི་ཁ་དོག་ཅན་བརྐྱང་སྟེ། རང་ཉིད་ཀྱི་ཕྱག་གིས་བཟུང་ནས། རབ་ཏུ་འཇུག་པར་བྱེད་དོ།
en: The Tathāgata Vairocana will extend his golden arm and usher the vidyā holder into the maṇḍala with his own hand.

source: །རང་ཉིད་མངོན་པར་དབང་བསྐུར་ཞིང་མངོན་པར་དབང་སྐུར་བར་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པའི་རིགས་ཐམས་ཅད་ཀྱིས་དམ་ཚིག་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་ཀྱི་དངོས་གྲུབ་ཀྱི་མཆོག་སྦྱིན་པ་རྗེས་སུ་སྩོལ་བར་བྱེད་དོ།
en: He will consecrate the vidyā holder himself and grant him the samaya of all the tathāgata families and the accomplishment of the mudrās and mantras.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོན་པར་བྱེད་དོ།
en: He will grant him every boon and will show him the buddha fields of all the tathāgatas. “

source: །ནད་སྣ་ཚོགས་པ་དང་ལྡན་པའི་འཇིག་རྟེན་པ་ཐམས་ཅད་རིག་སྔགས་འཆང་གི་རྒྱལ་པོ་གཅིག་པོར་འགྱུར་རོ།
en: The vidyā holder will become the sole king of all worldly vidyā holders and be free from all disease.

source: །སྐྱེ་བ་བརྗེ་བ་འཆི་འཕོ་བའི་དུས་སུ་དྲན་པ་ཉེ་བར་གནས་ཤིང་དུས་བྱེད་པར་འགྱུར་རོ།
en: When the time comes to take another birth and he leaves his body behind, he will retain the memory of his present life.
